Autodesk.Revit.DB.Structure.RebarCurvesData.GetRebarUpdateCurvesData
Gets a class that contains information used as input and output for rebar free form calculation.
Returns:
Gets a class that contains information used as input and output for rebar free form calculation.
Since:
2018

Autodesk.Revit.DB.Structure.RebarCurvesData.SetDistributionPath(System.Collections.Generic.IList{Autodesk.Revit.DB.Curve})
Sets a new distribution path to be applied to the rebar. This information is set to the rebar after the API execution is finished successfully.
Remarks:
For a free form rebar set the distance between two consecutive bars may be different if it is calculated between different points on bars.
The distribution path is an array of curves with the property that based on these curves the set was calculated to respect the layout rule and number of bars or spacing.
path:
Input curves that describe the new path.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Structure.RebarCurvesData.GetDistributionPath
Gets the distribution path currently stored in the rebar.
Remarks:
For a free form rebar set the distance between two consecutive bars may be different if it is calculated between different points on bars.
The distribution path is an array of curves with the property that based on these curves the set was calculated to respect the layout rule and number of bars or spacing.
Returns:
Returns array of curves that represent the distribution path.
Since:
2018

Autodesk.Revit.DB.Structure.RebarCurvesData.GetNumberOfBarGeometry
Gets the number of Bar Geometry that were added.
Returns:
Returns the number of Bar Geometry that were added.
Since:
2018

Autodesk.Revit.DB.Structure.RebarCurvesData.CanAddBarGeometry
If the layout rule is Singe or FixedNumber or NumberWithSpacing this function will return true if getNumberOfBarGeometry() is less getBarsNumber(), false otherwise.
If the layout rule is MaximumSpacing or MinimumClearSpacing this function will return always true.
Returns:
Returns true if we can add more bar geometry for the current layout, false otherwise.
Since:
2018

Autodesk.Revit.DB.Structure.RebarCurvesData.AddBarGeometry(Autodesk.Revit.DB.CurveLoop)
Adds a new bar to the new rebar geometry. This information is set to the rebar after the API execution is finished successfully.
Remarks:
This function can fail due to following reasons:
CurveLoop is empty.
CurveLoop contains an unbounded curve.
A rebar constructed from curves can't be bent according to the bending radius.
curves:
Curves describing one bar in the set.
Returns:
Returns Success if everything is ok, otherwise the failure reason.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Incorrect number of bar geometry for the current layout.
Since:
2018

Autodesk.Revit.DB.Structure.RebarCurvesData.AddBarGeometry(System.Collections.Generic.IList{Autodesk.Revit.DB.Curve})
Adds a new bar to the new rebar geometry. This information is set to the rebar after the API execution is finished successfully.
Remarks:
This function will can fail due to following reasons:
One or more of the input curves was null.
One or more of the input curves was unbounded.
Curves doesn't form a valid curve loop, it forms 0, 2 or more curve loops.
A rebar constructed from curves can't be bent according to the bending radius.
curves:
Curves describing one bar in the set.
Returns:
Returns Success if everything is ok, otherwise the failure reason.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Incorrect number of bar geometry for the current layout.
Since:
2018

Autodesk.Revit.DB.Structure.RebarCurvesData.ClearAllAddedBarGeometry
This function will remove all bars geometry that were added by calling AddBarGeometry().
Since:
2018

Autodesk.Revit.DB.Structure.RebarCurvesData.GetAddedBarGeometry(System.Int32)
Gets the added curves that will represent the bar at index barIndex.
barIndex:
The index of the bar. Should be a number between 0 and GetNumberOfBarGeometry() - 1.
Returns:
Returns the curves that will represent the bar at index barIndex. The hooks plane normals will be applied on these curves.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barIndex is not in the range [ 0, GetNumberOfBarGeometry()-1 ].
Since:
2018

Autodesk.Revit.DB.Structure.RebarCurvesData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.RebarCurvesData
The class that contains the information needed to calculate and return the result of the external curve generation.
Since:
2018